<a href="https://colab.research.google.com/github/dan9133/Pyspark_DataFrame/blob/main/Spark_TaskDF.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.4.0.tar.gz (310.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 310.8/310.8 MB 3.8 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.4.0-py2.py3-none-any.whl size=311317130 sha256=f21048950cd05d142589eacafb2124441be38ece4e013ed50ddbc12585ea5024
  Stored in directory: /root/.cache/pip/wheels/7b/1b/4b/3363a1d04368e7ff0d408e57ff57966fcdf00583774e761327
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.4.0

In [ ]:
from pyspark import SparkContext,SparkConf

In [ ]:
conf=SparkConf().setAppName("demo").setMaster("local")

In [ ]:
sc=SparkContext(conf=conf)

In [ ]:
from pyspark.sql import SparkSession

In [ ]:
spark=SparkSession.builder.getOrCreate()

In [ ]:
help(spark.createDataFrame)

Help on method createDataFrame in module pyspark.sql.session:

createDataFrame(data: Union[pyspark.rdd.RDD[Any], Iterable[Any], ForwardRef('PandasDataFrameLike'), ForwardRef('ArrayLike')], schema: Union[pyspark.sql.types.AtomicType, pyspark.sql.types.StructType, str, NoneType] = None, samplingRatio: Optional[float] = None, verifySchema: bool = True) -> pyspark.sql.dataframe.DataFrame method of pyspark.sql.session.SparkSession instance
    Creates a :class:`DataFrame` from an :class:`RDD`, a list, a :class:`pandas.DataFrame`
    or a :class:`numpy.ndarray`.

    .. versionadded:: 2.0.0

    .. versionchanged:: 3.4.0
        Supports Spark Connect.

    Parameters
    ----------
    data : :class:`RDD` or iterable
        an RDD of any kind of SQL data representation (:class:`Row`,
        :class:`tuple`, ``int``, ``boolean``, etc.), or :class:`list`,
        :class:`pandas.DataFrame` or :class:`numpy.ndarray`.
    schema : :class:`pyspark.sql.types.DataType`, str or list, optional
        a :class:`pyspark.sql.types.DataType` or a datatype string or a list of
        column names, default is None.  The data type string format equals to
        :class:`pyspark.sql.types.DataType.simpleString`, except that top level struct type can
        omit the ``struct<>``.

        When ``schema`` is a list of column names, the type of each column
        will be inferred from ``data``.

        When ``schema`` is ``None``, it will try to infer the schema (column names and types)
        from ``data``, which should be an RDD of either :class:`Row`,
        :class:`namedtuple`, or :class:`dict`.

        When ``schema`` is :class:`pyspark.sql.types.DataType` or a datatype string, it must
        match the real data, or an exception will be thrown at runtime. If the given schema is
        not :class:`pyspark.sql.types.StructType`, it will be wrapped into a
        :class:`pyspark.sql.types.StructType` as its only field, and the field name will be
        "value". Each record will also be wrapped into a tuple, which can be converted to row
        later.
    samplingRatio : float, optional
        the sample ratio of rows used for inferring. The first few rows will be used
        if ``samplingRatio`` is ``None``.
    verifySchema : bool, optional
        verify data types of every row against schema. Enabled by default.

        .. versionadded:: 2.1.0

    Returns
    -------
    :class:`DataFrame`

    Notes
    -----
    Usage with `spark.sql.execution.arrow.pyspark.enabled=True` is experimental.

    Examples
    --------
    Create a DataFrame from a list of tuples.

    >>> spark.createDataFrame([('Alice', 1)]).collect()
    [Row(_1='Alice', _2=1)]
    >>> spark.createDataFrame([('Alice', 1)], ['name', 'age']).collect()
    [Row(name='Alice', age=1)]

    Create a DataFrame from a list of dictionaries

    >>> d = [{'name': 'Alice', 'age': 1}]
    >>> spark.createDataFrame(d).collect()
    [Row(age=1, name='Alice')]

    Create a DataFrame from an RDD.

    >>> rdd = spark.sparkContext.parallelize([('Alice', 1)])
    >>> spark.createDataFrame(rdd).collect()
    [Row(_1='Alice', _2=1)]
    >>> df = spark.createDataFrame(rdd, ['name', 'age'])
    >>> df.collect()
    [Row(name='Alice', age=1)]

    Create a DataFrame from Row instances.

    >>> from pyspark.sql import Row
    >>> Person = Row('name', 'age')
    >>> person = rdd.map(lambda r: Person(*r))
    >>> df2 = spark.createDataFrame(person)
    >>> df2.collect()
    [Row(name='Alice', age=1)]

    Create a DataFrame with the explicit schema specified.

    >>> from pyspark.sql.types import *
    >>> schema = StructType([
    ...    StructField("name", StringType(), True),
    ...    StructField("age", IntegerType(), True)])
    >>> df3 = spark.createDataFrame(rdd, schema)
    >>> df3.collect()
    [Row(name='Alice', age=1)]

    Create a DataFrame from a pandas DataFrame.

    >>> spark.createDataFrame(df.toPandas()).collect()  # doctest: +SKIP
    [Row(name='Alice', age=1)]
    >>> spark.createDataFrame(pandas.DataFrame([[1, 2]])).collect()  # doctest: +SKIP
    [Row(0=1, 1=2)]

    Create  a DataFrame from an RDD with the schema in DDL formatted string.

    >>> spark.createDataFrame(rdd, "a: string, b: int").collect()
    [Row(a='Alice', b=1)]
    >>> rdd = rdd.map(lambda row: row[1])
    >>> spark.createDataFrame(rdd, "int").collect()
    [Row(value=1)]

    When the type is unmatched, it throws an exception.

    >>> spark.createDataFrame(rdd, "boolean").collect() # doctest: +IGNORE_EXCEPTION_DETAIL
    Traceback (most recent call last):
        ...
    Py4JJavaError: ...

In [ ]:
data= [("James","","Smith","36636","M",60000),

        ("Michael","Rose","","40288","M",70000),

        ("Robert","","Williams","42114","",400000),

        ("Maria","Anne","Jones","39192","F",500000),

        ("Jen","Mary","Brown","","F",0)]

In [ ]:
df=spark.createDataFrame(data)

In [ ]:
df.show()

+-------+----+--------+-----+---+------+
|     _1|  _2|      _3|   _4| _5|    _6|
+-------+----+--------+-----+---+------+
|  James|    |   Smith|36636|  M| 60000|
|Michael|Rose|        |40288|  M| 70000|
| Robert|    |Williams|42114|   |400000|
|  Maria|Anne|   Jones|39192|  F|500000|
|    Jen|Mary|   Brown|     |  F|     0|
+-------+----+--------+-----+---+------+

In [ ]:
df.printSchema()

root
 |-- _1: string (nullable = true)
 |-- _2: string (nullable = true)
 |-- _3: string (nullable = true)
 |-- _4: string (nullable = true)
 |-- _5: string (nullable = true)
 |-- _6: long (nullable = true)

In [ ]:
#Create a Dataframe using user defined schema (str type) with same data as given on Task 1
import pandas as pd
from ast import literal_eval

# User-defined schema in string form
user_define_str = '''
[("James","","Smith","36636","M",60000),
 ("Michael","Rose","","40288","M",70000),
 ("Robert","","Williams","42114","",400000),
 ("Maria","Anne","Jones","39192","F",500000),
 ("Jen","Mary","Brown","","F",0)]
'''

# Convert the user-defined schema from string to a list of tuples
user_define = literal_eval(user_define_str)

# Define column names for the schema
columns = ['First Name', 'Middle Name', 'Last Name', 'ID', 'Gender', 'Salary']

# Create a DataFrame using the user-defined schema and data
df = pd.DataFrame(user_define, columns=columns)

# Print the DataFrame
print(df)

  First Name Middle Name Last Name     ID Gender  Salary
0      James                 Smith  36636      M   60000
1    Michael        Rose            40288      M   70000
2     Robert              Williams  42114         400000
3      Maria        Anne     Jones  39192      F  500000
4        Jen        Mary     Brown             F       0

In [ ]:
# Create a Dataframe using user defined schema (List type) with same data as given on

data = [
    ["James", "", "Smith", "36636", "M", 60000],
    ["Michael", "Rose", "", "40288", "M", 70000],
    ["Robert", "", "Williams", "42114", "", 400000],
    ["Maria", "Anne", "Jones", "39192", "F", 500000],
    ["Jen", "Mary", "Brown", "", "F", 0]
]

In [ ]:
schema = ["First Name", "Middle Name", "Last Name", "ID", "Gender", "Salary"]

In [ ]:
df = pd.DataFrame(data, columns=schema)
print(df)

  First Name Middle Name Last Name     ID Gender  Salary
0      James                 Smith  36636      M   60000
1    Michael        Rose            40288      M   70000
2     Robert              Williams  42114         400000
3      Maria        Anne     Jones  39192      F  500000
4        Jen        Mary     Brown             F       0

In [ ]:
# Create a Dataframe using user defined schema (pyspark data type) with same data

from pyspark.sql import SparkSession
from pyspark.sql.types import StringType, IntegerType, StructField, StructType
import datetime
# Create a SparkSession
spark = SparkSession.builder.getOrCreate()

# User-defined schema using PySpark data types
schema = StructType([
    StructField("First Name", StringType(), nullable=True),
    StructField("Middle Name", StringType(), nullable=True),
    StructField("Last Name", StringType(), nullable=True),
    StructField("ID", StringType(), nullable=True),
    StructField("Gender", StringType(), nullable=True),
    StructField("Salary", IntegerType(), nullable=True)
])

# Data provided
data = [
    ("James", "", "Smith", "36636", "M", 60000),
    ("Michael", "Rose", "", "40288", "M", 70000),
    ("Robert", "", "Williams", "42114", "", 400000),
    ("Maria", "Anne", "Jones", "39192", "F", 500000),
    ("Jen", "Mary", "Brown", "", "F", 0)
]

# Create a DataFrame using the user-defined schema and data
df = spark.createDataFrame(data, schema)

# Print the DataFrame
df.show()

+----------+-----------+---------+-----+------+------+
|First Name|Middle Name|Last Name|   ID|Gender|Salary|
+----------+-----------+---------+-----+------+------+
|     James|           |    Smith|36636|     M| 60000|
|   Michael|       Rose|         |40288|     M| 70000|
|    Robert|           | Williams|42114|      |400000|
|     Maria|       Anne|    Jones|39192|     F|500000|
|       Jen|       Mary|    Brown|     |     F|     0|
+----------+-----------+---------+-----+------+------+

In [ ]:
 import pandas as pd

users = [
    {
        "id": 1,
        "first_name": 'Sachin',
        "last_name": 'Tendulkar',
        "mail": 'sachin@mail.com',
        "phone_numbers": ["+1 234 567 789", "+91 123987645"],
        "is_customer": True,
        "amount_paid": 1000.2,
        "customer_from": datetime.date(2002, 12, 31),
        "last_update_ts": datetime.date(2022, 1, 1)
    },
    {
        "id": 2,
        "first_name": 'M S',
        "last_name": 'Dhoni',
        "mail": 'mahi@mail.com',
        "phone_numbers": ["+1 789 567 234", "+91 124137645"],
        "is_customer": True,
        "amount_paid": 2000.4,
        "customer_from": datetime.date(2004, 5, 30),
        "last_update_ts": datetime.date(2022, 11, 29)
    },
    {
        "id": 3,
        "first_name": 'Rahul',
        "last_name": 'Dravid',
        "mail": 'Rahul@mail.com',
        "phone_numbers": ["", "+91 124137645"],
        "is_customer": True,
        "amount_paid": 3000.0,
        "customer_from": datetime.date(2016, 3, 18),
        "last_update_ts": datetime.date(2020, 3, 24)
    },
    {
        "id": 4,
        "first_name": 'Hardik',
        "last_name": 'pandya',
        "mail": 'hardik@mail.com',
        "phone_numbers": ["+1 789 567 234", ""],
        "is_customer": True,
        "amount_paid": 1500.5,
        "customer_from": datetime.date(1990, 12, 3),
        "last_update_ts": datetime.date(2022, 3, 2)
    },
    {
        "id": 5,
        "first_name": 'Shubman',
        "last_name": 'Gill',
        "mail": 'shubman@mail.com',
        "phone_numbers": ["", ""],
        "is_customer": True,
        "amount_paid": 500.5,
        "customer_from": datetime.date(1995, 2, 19),
        "last_update_ts": datetime.date(2022, 1, 21)
    }
]

# Create a DataFrame from the given data
df = pd.DataFrame(users)

# Print the DataFrame
print(df)

   id first_name  last_name              mail  \
0   1     Sachin  Tendulkar   sachin@mail.com
1   2        M S      Dhoni     mahi@mail.com
2   3      Rahul     Dravid    Rahul@mail.com
3   4     Hardik     pandya   hardik@mail.com
4   5    Shubman       Gill  shubman@mail.com

                     phone_numbers  is_customer  amount_paid customer_from  \
0  [+1 234 567 789, +91 123987645]         True       1000.2    2002-12-31
1  [+1 789 567 234, +91 124137645]         True       2000.4    2004-05-30
2                [, +91 124137645]         True       3000.0    2016-03-18
3               [+1 789 567 234, ]         True       1500.5    1990-12-03
4                             [, ]         True        500.5    1995-02-19

  last_update_ts
0     2022-01-01
1     2022-11-29
2     2020-03-24
3     2022-03-02
4     2022-01-21

In [ ]:
 # Create a Dataframe using user defined schema (pyspark data type) with same data as given on Task 5

# Define the user-defined schema
from pyspark.sql import SparkSession
from pyspark.sql import types as T
import datetime

# Create a SparkSession
spark = SparkSession.builder.getOrCreate()
schema = T.StructType([
    T.StructField("id", T.IntegerType(), True),
    T.StructField("first_name", T.StringType(), True),
    T.StructField("last_name", T.StringType(), True),
    T.StructField("mail", T.StringType(), True),
    T.StructField("phone_numbers", T.ArrayType(T.StringType()), True),
    T.StructField("is_customer", T.BooleanType(), True),
    T.StructField("amount_paid", T.DoubleType(), True),
    T.StructField("customer_from", T.DateType(), True),
    T.StructField("last_update_ts", T.DateType(), True)
])

In [ ]:
# Create the DataFrame
df = spark.createDataFrame(users, schema)

# Show the DataFrame
df.show()

+---+----------+---------+----------------+--------------------+-----------+-----------+-------------+--------------+
| id|first_name|last_name|            mail|       phone_numbers|is_customer|amount_paid|customer_from|last_update_ts|
+---+----------+---------+----------------+--------------------+-----------+-----------+-------------+--------------+
|  1|    Sachin|Tendulkar| sachin@mail.com|[+1 234 567 789, ...|       true|     1000.2|   2002-12-31|    2022-01-01|
|  2|       M S|    Dhoni|   mahi@mail.com|[+1 789 567 234, ...|       true|     2000.4|   2004-05-30|    2022-11-29|
|  3|     Rahul|   Dravid|  Rahul@mail.com|   [, +91 124137645]|       true|     3000.0|   2016-03-18|    2020-03-24|
|  4|    Hardik|   pandya| hardik@mail.com|  [+1 789 567 234, ]|       true|     1500.5|   1990-12-03|    2022-03-02|
|  5|   Shubman|     Gill|shubman@mail.com|                [, ]|       true|      500.5|   1995-02-19|    2022-01-21|
+---+----------+---------+----------------+--------------------+-----------+-----------+-------------+--------------+

In [ ]:


# Use Df from task 6 and create new dataframe where first_name and last_name should be one column


from pyspark.sql import SparkSession
from pyspark.sql.functions import concat, col,lit

# Create a SparkSession
spark = SparkSession.builder.getOrCreate()

# Assuming df is the DataFrame from Task 6
df = spark.createDataFrame(users)

# Create a new column by combining first_name and last_name
df = df.withColumn('Full_name', concat(col('first_name'), col('last_name')))


#  Drop the original first_name and last_name columns
df = df.drop('first_name', 'last_name')

# Show the updated DataFrame
df.show()

+-----------+-------------+---+-----------+--------------+----------------+--------------------+---------------+
|amount_paid|customer_from| id|is_customer|last_update_ts|            mail|       phone_numbers|      Full_name|
+-----------+-------------+---+-----------+--------------+----------------+--------------------+---------------+
|     1000.2|   2002-12-31|  1|       true|    2022-01-01| sachin@mail.com|[+1 234 567 789, ...|SachinTendulkar|
|     2000.4|   2004-05-30|  2|       true|    2022-11-29|   mahi@mail.com|[+1 789 567 234, ...|       M SDhoni|
|     3000.0|   2016-03-18|  3|       true|    2020-03-24|  Rahul@mail.com|   [, +91 124137645]|    RahulDravid|
|     1500.5|   1990-12-03|  4|       true|    2022-03-02| hardik@mail.com|  [+1 789 567 234, ]|   Hardikpandya|
|      500.5|   1995-02-19|  5|       true|    2022-01-21|shubman@mail.com|                [, ]|    ShubmanGill|
+-----------+-------------+---+-----------+--------------+----------------+--------------------+---------------+

In [ ]:
# . task 8
from pyspark.sql.functions import col,concat,lit
from pyspark.sql.functions import *

# Assuming df is the DataFrame with the 'name' column
df = df.withColumn('sports_name', lit('cricketers'))


# Show the updated DataFrame
df.show()

+-----------+-------------+---+-----------+--------------+----------------+--------------------+---------------+-----------+
|amount_paid|customer_from| id|is_customer|last_update_ts|            mail|       phone_numbers|      Full_name|sports_name|
+-----------+-------------+---+-----------+--------------+----------------+--------------------+---------------+-----------+
|     1000.2|   2002-12-31|  1|       true|    2022-01-01| sachin@mail.com|[+1 234 567 789, ...|SachinTendulkar| cricketers|
|     2000.4|   2004-05-30|  2|       true|    2022-11-29|   mahi@mail.com|[+1 789 567 234, ...|       M SDhoni| cricketers|
|     3000.0|   2016-03-18|  3|       true|    2020-03-24|  Rahul@mail.com|   [, +91 124137645]|    RahulDravid| cricketers|
|     1500.5|   1990-12-03|  4|       true|    2022-03-02| hardik@mail.com|  [+1 789 567 234, ]|   Hardikpandya| cricketers|
|      500.5|   1995-02-19|  5|       true|    2022-01-21|shubman@mail.com|                [, ]|    ShubmanGill| cricketers|
+-----------+-------------+---+-----------+--------------+----------------+--------------------+---------------+-----------+

In [ ]:
# create the DF in emp table
import pandas as pd

employees = [(1, "Scott", "Tiger", 1000.0,
              "united states", "+1 123 456 7890", "123 45 6789"),
             (2, "Henry", "Ford", 1250.0,
              "India", "+91 234 567 8901", "456 78 9123"),
             (3, "Nick", "Junior", 750.0,
              "united KINGDOM", "+44 111 111 1111", "222 33 4444"),
             (4, "Bill", "Gomes", 1500.0,
              "AUSTRALIA", "+61 987 654 3210", "789 12 6118")]

column_names = ['employee_id', 'first_name', 'last_name', 'salary',
                'nationality', 'phone_number', 'ssn']

employeesDF = pd.DataFrame(employees, columns=column_names)

In [ ]:
#print(employeesDF)
display(employeesDF)

,employee_id,first_name,last_name,salary,nationality,phone_number,ssn
0,1,Scott,Tiger,1000.0,united states,+1 123 456 7890,123 45 6789
1,2,Henry,Ford,1250.0,India,+91 234 567 8901,456 78 9123
2,3,Nick,Junior,750.0,united KINGDOM,+44 111 111 1111,222 33 4444
3,4,Bill,Gomes,1500.0,AUSTRALIA,+61 987 654 3210,789 12 6118

In [ ]:
# I want empId,salary,phone_num,and ssn in Df forms

import pandas as pd

# Assuming you already have the employeesDF DataFrame

# Create a new DataFrame with desired columns
modifiedDF = employeesDF[['employee_id','phone_number','ssn']].copy()

# # Extract last four digits of phone_number and ssn
modifiedDF['phone_number'] = employeesDF['phone_number'].str[-4:]
modifiedDF['ssn'] = employeesDF['ssn'].str[-4:]

# Display the modified DataFrame
modifiedDF

   employee_id phone_number   ssn
0            1         7890  6789
1            2         8901  9123
2            3         1111  4444
3            4         3210  6118

In [ ]:
"""Create new df from the given data

schema=["name", "subject", "Marks", "Attendance"]

student_data=[("John","Math", 90, 80),("Michael", "Science", 70, None), ("David", "History", 50,40), ("Kelvin", "Computer", 40,None ),
("Paul", "GEO", None, None), (None,None, None, None)]"""



import pandas as pd

schema = ["name", "subject", "Marks", "Attendance"]
student_data = [("John", "Math", 90, 80),
                ("Michael", "Science", 70, None),
                ("David", "History", 50, 40),
                ("Kelvin", "Computer", 40, None),
                ("Paul", "GEO", None, None),
                (None, None, None, None)]

student_df = pd.DataFrame(student_data, columns=schema)

In [ ]:
  display(student_df)

      name   subject  Marks  Attendance
0     John      Math   90.0        80.0
1  Michael   Science   70.0         NaN
2    David   History   50.0        40.0
3   Kelvin  Computer   40.0         NaN
4     Paul       GEO    NaN         NaN
5     None      None    NaN         NaN

In [ ]:
"""Use df from Task (3) and handle null values. Nulls in name column should be replaced with unknown, subject column should be replaced with EVS,
 Marks should be replaced with 40
 and attendance should be replaced with 35. Finally you should get output in this way"""

import pandas as pd

# Assuming you already have the student_df DataFrame from Task 3

# Replace null values with specified values
student_df["name"].fillna("unknown", inplace=True)
student_df["subject"].fillna("EVS", inplace=True)
student_df["Marks"].fillna(40, inplace=True)
student_df["Attendance"].fillna(35, inplace=True)

# Display the modified DataFrame
student_df

      name   subject  Marks  Attendance
0     John      Math   90.0        80.0
1  Michael   Science   70.0        35.0
2    David   History   50.0        40.0
3   Kelvin  Computer   40.0        35.0
4     Paul       GEO   40.0        35.0
5  unknown       EVS   40.0        35.0

In [ ]:
#


from pyspark.sql import SparkSession
from pyspark.sql import Row
import datetime

# Create SparkSession
spark = SparkSession.builder.getOrCreate()

# Define the data
users = [
    {
        "id": 1,
        "first_name": "Corrie",
        "last_name": "Van den Oord",
        "email": "cvandenoord0@etsy.com",
        "phone_numbers": Row(mobile="+1 234 567 8901", home="+1 234 567 8911"),
        "courses": [1, 2],
        "is_customer": True,
        "amount_paid": 1000.55,
        "customer_from": datetime.date(2021, 1, 15),
        "last_updated_ts": datetime.datetime(2021, 2, 10, 1, 15, 0)
    },
    {
        "id": 2,
        "first_name": "Nikolaus",
        "last_name": "Brewitt",
        "email": "nbrewitt1@dailymail.co.uk",
        "phone_numbers": Row(mobile="+1 234 567 8923", home="1 234 567 8934"),
        "courses": [3],
        "is_customer": True,
        "amount_paid": 900.0,
        "customer_from": datetime.date(2021, 2, 14),
        "last_updated_ts": datetime.datetime(2021, 2, 18, 3, 33, 0)
    },
    {
        "id": 3,
        "first_name": "Orelie",
        "last_name": "Penney",
        "email": "openney2@vistaprint.com",
        "phone_numbers": Row(mobile="+1 714 512 9752", home="+1 714 512 6601"),
        "courses": [2, 4],
        "is_customer": True,
        "amount_paid": 850.55,
        "customer_from": datetime.date(2021, 1, 21),
        "last_updated_ts": datetime.datetime(2021, 3, 15, 15, 16, 55)
    },
    {
        "id": 4,
        "first_name": "Ashby",
        "last_name": "Maddocks",
        "email": "amaddocks3@home.pl",
        "phone_numbers": Row(mobile=None, home=None),
        "courses": [],
        "is_customer": False,
        "amount_paid": None,
        "customer_from": None,
        "last_updated_ts": datetime.datetime(2021, 4, 10, 17, 45, 30)
    },
    {
        "id": 5,
        "first_name": "Kurt",
        "last_name": "Rome",
        "email": "krome4@shutterfly.com",
        "phone_numbers": Row(mobile="+1 817 934 7142", home=None),
        "courses": [],
        "is_customer": False,
        "amount_paid": None,
        "customer_from": None,
        "last_updated_ts": datetime.datetime(2021, 4, 2, 0, 55, 18)
    }
]

# Create DataFrame
usersDF = spark.createDataFrame(users)

In [ ]:
usersDF.show()

+-----------+-------+-------------+--------------------+----------+---+-----------+------------+-------------------+--------------------+
|amount_paid|courses|customer_from|               email|first_name| id|is_customer|   last_name|    last_updated_ts|       phone_numbers|
+-----------+-------+-------------+--------------------+----------+---+-----------+------------+-------------------+--------------------+
|    1000.55| [1, 2]|   2021-01-15|cvandenoord0@etsy...|    Corrie|  1|       true|Van den Oord|2021-02-10 01:15:00|{+1 234 567 8901,...|
|      900.0|    [3]|   2021-02-14|nbrewitt1@dailyma...|  Nikolaus|  2|       true|     Brewitt|2021-02-18 03:33:00|{+1 234 567 8923,...|
|     850.55| [2, 4]|   2021-01-21|openney2@vistapri...|    Orelie|  3|       true|      Penney|2021-03-15 15:16:55|{+1 714 512 9752,...|
|       null|     []|         null|  amaddocks3@home.pl|     Ashby|  4|      false|    Maddocks|2021-04-10 17:45:30|        {null, null}|
|       null|     []|         null|krome4@shutterfly...|      Kurt|  5|      false|        Rome|2021-04-02 00:55:18|{+1 817 934 7142,...|
+-----------+-------+-------------+--------------------+----------+---+-----------+------------+-------------------+--------------------+

In [ ]:
# Use df from task 5 and Sort the data in ascending order by customer_from

# Sort the data in ascending order by customer_from and select customer_from and id columns
sortedDF = usersDF.orderBy(asc("customer_from")).select("customer_from", "id")

# Display the sorted DataFrame
sortedDF.show()

+-------------+---+
|customer_from| id|
+-------------+---+
|         null|  4|
|         null|  5|
|   2021-01-15|  1|
|   2021-01-21|  3|
|   2021-02-14|  2|
+-------------+---+

In [ ]:
#

# Assuming you already have the usersDF DataFrame from Task 5

# Sort the data in ascending order by customer_from with null values coming at the end
sortedDF = usersDF.orderBy(usersDF["customer_from"].asc_nulls_last()).select("customer_from", "id")

# Display the sorted DataFrame
sortedDF.show()

+-------------+---+
|customer_from| id|
+-------------+---+
|   2021-01-15|  1|
|   2021-01-21|  3|
|   2021-02-14|  2|
|         null|  4|
|         null|  5|
+-------------+---+

In [ ]:
import os
os.listdir('.')

['.config', 'sample_data']

In [ ]:
!ls

sample_data

In [ ]:
import pandas as pd
from google.colab import files

uploaded = files.upload()

In [ ]:
import io
df2 = pd.read_csv(io.BytesIO(uploaded['/content/airline_dec_2008_50k.csv'))

# New Section

# New Section